project/php_project/api/modules/system/controllers/DesktopController.php

    public function actionGetCustomSelectDesktop($uid){
        $result = SysCustomDesktop::find()->where(['uid'=>$uid])->all();
---
SELECT * FROM `sys_custom_desktop` WHERE `uid`='1'