project/php_project/api/modules/system/controllers/VerifyRecordController.php

SELECT `item_name` FROM `auth_assignment` WHERE `user_id`='1'
SELECT * FROM `user` WHERE `user_id`='1'
---
    public function actionCount($id)
    {
        $res = AuthAssignment::find()->select('item_name')->where(['user_id' => $id])->all();
        $resArr = [];
        foreach ($res as $k => $v) {
            $resArr[] = $v['item_name'];
        }
        $user = User::findOne($id);

SELECT COUNT(*) FROM `crm_imessage` WHERE ((`imesg_receiver`='1103') AND ((`imesg_btime` <= '2018-03-23 08:24:18') AND (`imesg_etime` >= '2018-03-23 08:24:18'))) AND (`imesg_status` = '1')
---
    public function actionInformCount($id)
    {
        //        $res = AuthAssignment::find()->where(['user_id'=>$id])->one();
        $result = CrmImessage::find()->where(['imesg_receiver' => $id])->andWhere(['and', ['<=', 'imesg_btime', date('Y-m-d H:i:s', time())], ['>=', 'imesg_etime', date('Y-m-d H:i:s', time())]])->andWhere(['=', 'imesg_status', CrmImessage::STATUS_DEFAULT])->count();