project/php_project/api/modules/system/models/SysDisplayList.php

SELECT * FROM `sys_display_list` WHERE `ddi_pid`=0
SELECT * FROM `sys_display_list` WHERE `ddi_pid`='1'
---
    public static function getTree($pid = 0)
    {
        static $str = "";
        $tree = self::find()->andWhere(['ddi_pid' => $pid])->all();
        $selected=false;
        foreach ($tree as $key => $val) {
            $childs = self::find()->where(['ddi_pid' => $val['ddi_sid']])->one();