project/php_project/api/modules/hr/models/HrOrganization.php

SELECT * FROM `hr_organization` WHERE `organization_code`='FOXCONN'
---
    public static function byCodeOrg($code)
    {
        return self::find()->where(['organization_code' => $code])->asArray()->one();