project/php_project/api/modules/common/models/BsForm.php

    public static function getTree($pid = 0)
    {
        static $str = "";
        $tree = self::find()->andWhere(['form_pid' => $pid])->all();
        $selected=false;
        foreach ($tree as $key => $val) {
            $childs = self::find()->where(['form_pid' => $val['form_sid']])->one();
---
SELECT * FROM `bs_form` WHERE `form_pid`=0
SELECT * FROM `bs_form` WHERE `form_pid`=100000000