project/php_project/api/modules/ptdt/controllers/ProductListController.php

    public function actionGetNextLevel($id){
        if(empty($id)){
            return BsCategory::find()->select("catg_name")->where(["catg_level"=>1,"isvalid"=>1])->asArray()->indexBy("catg_id")->column();
---
SELECT `catg_name`, `catg_id` FROM `pdt`.`bs_category` WHERE (`catg_level`=1) AND (`isvalid`=1)